Revit 2026 API

# IFCExtrusionCalculatorUtils Class

---

A utility class used to calculate extrusion data from Revit geometry for IFC export.

SystemObject Autodesk.Revit.DB.IFCIFCExtrusionCalculatorUtils

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class IFCExtrusionCalculatorUtils
```
```vb
Public NotInheritable Class IFCExtrusionCalculatorUtils
```
```cpp
public ref class IFCExtrusionCalculatorUtils abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type IFCExtrusionCalculatorUtils = class end
```

The IFCExtrusionCalculatorUtils type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CalculateExtrusionData(IFCExtrusionCalculatorOptions, GeometryObject) | Calculates the extrusion data from a Revit geometry object. |
|  | CalculateExtrusionData(IFCExtrusionCalculatorOptions, IListFace) |  |

#### Reference

Autodesk.Revit.DB.IFC Namespace